Revit 2027 API
AnalyticalEquipmentLoadData.LoadType Property
 The load type of analytical equipment load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElectricalLoadType LoadType { get; }
Public ReadOnly Property LoadType As ElectricalLoadType
	Get
public:
property ElectricalLoadType LoadType {
	ElectricalLoadType get ();
}
member LoadType : ElectricalLoadType with get
Property Value
ElectricalLoadType
See Also
Reference
AnalyticalEquipmentLoadData Class
Autodesk.Revit.DB.Electrical Namespace